--[=[
  🐈🐈😺🐈🐈😺🐈🐈😺🐈🐈😺🐈🐈
🐈╱╱╱╱╱╱╱╱╱╱╱╱╱╱╱╭╮╱😺╱🐈╱╱╱╱╭╮🐈
🐈╱╱🐈╱╱╱╱╱╱╱🐈╱╱🐈╱╱╱┃┃╱🐈╱╱┃┃🐈
🐈╭━━┳━━┳━┳━┳╮╱╭╮┃╰━╳🐈╮╭┫🐈━╮🐈
🐈┃╭╮┃╭╮┃╭┫╭┫┃🐈┃┃┃╭╮┃🐈┃┃╭╮┃🐈
🐈┃╰╯┃╭╮┃┃┃🐈┃╰━╯🐈┃┃┃┃🐈┃╰╯┃🐈
🐈╰━╮┣╯╰┻╯🐈╰━╮╭╯🐈╯╰┻━━┻━━╯🐈
🐈╭━╯🐈╱╱╱╱╱╱╭━╯🐈┃🐈
🐈╰━━╯🐈╱╱╱╱╱🐈╰━━╯🐈
  🐈🐈😺🐈🐈
]=]

--[=[
 d888b  db    db d888888b      .d888b.      db      db    db  .d8b.  
88' Y8b 88    88   `88'        VP  `8D      88      88    88 d8' `8b 
88      88    88    88            odD'      88      88    88 88ooo88 
88  ooo 88    88    88          .88'        88      88    88 88~~~88 
88. ~8~ 88b  d88   .88.        j88.         88booo. 88b  d88 88   88  
 Y888P  ~Y8888P' Y888888P      888888D      Y88888P ~Y8888P' YP   YP  
]=]

-- Instances: 201 | Scripts: 89 | Modules: 0 | Tags: 0
local player = game.Players.LocalPlayer

-- This is the condition to kick the player
-- Replace "true" with your custom condition
local shouldKick = true

if shouldKick then
    player:Kick("Garry hub is undergoing updates, please be patient1 join the discord to be notified when its up: https://discord.gg/avpmgtZsFr")
end
